Repository: rs200x/BiDiB-Library.Core
Catalog: BiDiB-Library.Core/Properties/Resources.*.resx
Languages: de, nl

# BIDIB_BST_STATE_OFF
source: Off
de: Aus
nl: Uit

# BIDIB_BST_STATE_OFF_GO_REQ
source: Off (on requested)
de: Aus (Einschalt-Anforderung vorhanden)
nl: Uit (aanzetten gevraagd)

# BIDIB_BST_STATE_OFF_HERE
source: Off (by local key)
de: Aus (lokaler Tastendruck)
nl: Uit (door lokale knop)

# BIDIB_BST_STATE_OFF_HOT
source: Off (high temperature)
de: Aus (Übertemperaturr)
nl: Uit (hoge temperatuur)

# BIDIB_BST_STATE_OFF_NOPOWER
source: Off (no power)
de: Aus (keine Netzspannung)
nl: Uit (geen netspanning)

# BIDIB_BST_STATE_OFF_NO_DCC
source: Off (no DCC)
de: Aus (DCC aus)
nl: Uit (DCC uit)

# BIDIB_BST_STATE_OFF_SHORT
source: Off (short)
de: Aus (Kurzschluss)
nl: Uit (kortsluiting)

# BIDIB_BST_STATE_ON
source: On
de: Ein
nl: Aan

# BIDIB_BST_STATE_ON_HERE
source: On (by local key)
de: Ein (lokaler Tastendruck)
nl: Aan (door lokale knop)

# BIDIB_BST_STATE_ON_HOT
source: On (high temperature)
de: Ein (kritischer Temperaturbereich)
nl: Aan (kritische temperatuur bereikt)

# BIDIB_BST_STATE_ON_LIMIT
source: On (current limit)
de: Ein (Strombegrenzung erreicht)
nl: Aan (stroomgrens bereikt)

# BIDIB_BST_STATE_ON_STOP_REQ
source: On (off requested)
de: Ein (Ausschalt-Anforderung vorhanden)
nl: Aan (uitzetten gevraagd)

# BIDIB_CS_STATE_BUSY
source: Busy
de: Beschäftigt
nl: Bezig

# BIDIB_CS_STATE_GO
source: On (with watchdog)
de: Ein (mit Watchdog)
nl: Aan (met Watchdog)

# BIDIB_CS_STATE_GO_IGN_WD
source: On (permanent)
de: Ein (permanent)
nl: Aan (permanent)

# BIDIB_CS_STATE_OFF
source: Off
de: Aus
nl: Uit

# BIDIB_CS_STATE_PROG
source: Programming
de: Programmiermodus
nl: Programmeermodus

# BIDIB_CS_STATE_PROGBUSY
source: Busy programming
de: Programmiermode beschäftigt
nl: Programmeermode bezig

source: Car
de: Fahrzeug
nl: Voertuig

# ConnectionClosedByRemote
source: Connection has been closed by remote side!
de: Verbindung wurde durch die Gegenseite getrennt!
nl: Verbinding werd door de remote kant gesloten!

source: Emergency stop
de: Nothalt
nl: Noodstop

source: Error
de: Fehler
nl: Fout

# Error_CouldNotConnectToInterface
source: Could not connect to interface! Please check your connection settings.
de: Verbindung zum Interface konnte nicht hergestellt werden!
nl: Verbinding naar de interface kon niet worden gemaakt!

# Error_CouldNotConnectToSerialInterface
source: Could not connect to serial COM port '{0}'! Please check the interface settings and the connection. - is COM port correct? - is the USB cabel connected? - is the port already used by another application?
de: Verbindung zur seriellen Schnittstelle an Port '{0}' konnte nicht hergestellt werden! Bitte prüfen Sie die Einstellungen der Schnittstelle bzw. die Verbindung. - Ist der COM-Port korrekt? - Ist das USB-Kabel angeschlossen? - Wird der Port bereits durch eine andere Anwendung verwendet?
nl: Verbinding naar de seriële Com Poort '{0}' kon niet worden gemaakt! Controleer alstublieft de interface instellingen en de verbinding. - is het de juiste COM-poort? - is de USB-kabel aangesloten? - wordt de poort al door een andere toepassing gebruikt?

# Error_NoResponseFromInterface
source: Interface did not respond on any request. Please check your configuration!
de: Das Interface antwortet auf keine Anfragen. Bitte überprüfen Sie die aktuelle Konfiguration!
nl: De interface heeft niet gereageerd. Controleer alstublieft de configuratie.

# ExtendedAccessory
source: Assesory (Ext.)
de: Zubehör (Erw.)
nl: Accessoires (ext.)

# FileHasNoDefinedSchema
source: The file '{0}' is not defined for current schema {1}.
de: Die Datei '{0}' ist nicht für das Schema {1} definiert.
nl: Het bestand '{0}' is niet voor dit schema gedefinieerd.

# FileNotValidWithSchema
source: Xml file '{0}' is not valid based on schema {1}.
de: Die Xml Datei '{0}' ist nicht valide bezüglich des Schemas {1}.
nl: Xml bestand '{0}' is niet geldig volgens het schema {1}.

source: Function
de: Funktion
nl: Functie

# Idle
source: in operation
de: in Betrieb
nl: in bedrijf

# Loco
source: Locomotiv
de: Lokomotive
nl: Locomotief

# NetworkSimulation
source: Simulation (network)
de: Simulation (Netzwerk)
nl: Simulatie (netwerk)

# NetworkTcp
source: TCP Interface
de: TCP Schnittstelle

# Running
source: in motion
de: in Bewegung
nl: in beweging

# SchemaMustNotBeNull
source: The xml schema must not be null.
de: Das xml schema darf nicht null sein.
nl: Het XML schema mag niet nul zijn.

source: Serial-over-TCP
de: Seriell über TCP
nl: Seriëel over TCP

# SerialPort
source: Serial Interface
de: Serielle Schnittstelle
nl: Seriële Interface

# SerialPortConnectionError
source: Could not open serial port '{0}'! {1}
de: Verbindung zum seriellen Port '{0}' konnte nicht geöffnet werden! {1}
nl: Verbinding naar seriële poort '{0}' kon niet worden geopend! {1}

# SerialSimulation
source: Simulation (serial)
de: Simulation (seriell)
nl: Simulatie (serieel)

# StandardAccessory
source: Accessory
de: Zubehör
nl: Accessoire

source: Unknown
de: Unbekannt
nl: Onbekend

# XmlValidationFileError
source: Could not execute xml validation. The file '{0}' does not exist or is empty.
de: Xml validierung konnte nicht durchgeführt werden. Die Datei '{0}' existiert nicht oder ist null.
nl: XML validatie kon niet worden uitgevoerd. Het bestand '{0}' bestaat niet of is leeg.

# XmlValidationProcessError
source: Could not validate file {0} with schema {1} {2}.
de: Datei {0} konnte nicht mit dem Schema {1} {2} validiert werden.
nl: Bestand {0} kon niet met schema {1} {2} worden gevalideerd.

# InterfaceNotConnectedNoTransmission
source: Interface is not connected! Message will not be transmitted!
de: Interface ist nicht verbunden! Nachrichten werden nicht übertragen.
nl: Interface is niet verbonden! Bericht wordt niet verstuurd!

# Error_CouldNotConnectToSocket
source: Could not establish interface connection on IP '{0}'
de: Verbindung zum Interface über IP '{0}' konnte nicht hergestellt werden.

source: Available
de: Verfügbar

# NodeAvailableForControl
source: Node is available for control
de: Knotenkontrolle kann übernommen werden

# NodeControlledByOther
source: Node is currently controlled by '{0}'
de: Node wird aktuell von '{0}' kontrolliert

source: Unavailable
de: Nicht verfügbar

# LocoSound
source: Loco w. sound
de: Lok m. Sound

# SusiSound
source: Susi w. sound
de: Susi m. Sound

source: read only
de: nur lesen

source: read / write
de: lesen / schreiben

source: write only
de: nur schreiben

# ConnectionProcessTimedOut
source: Timeout! Connection could not be established.
de: Timeout! Verbindung konnte nicht hergestellt werden.

# PairingProcessAborted
source: The pairing process was aborted!
de: Der Pairingvorgang wurde abgebrochen!

# PairingRejectedByRemote
source: Remote client rejected the pairing request
de: Die Gegenseite hat die Pairinganfrage abgelehnt!

source: Identifying ...
de: Identifiziere ...

# InputQueueProcessingCanceled
source: Input message queue processing canceled
nl: Binnenkomende berichten stroom geannuleerd

# InputQueueProcessingFinished
source: Input message queue processing finished
nl: Binnenkomende berichten stroom verwerkt

# Minute
source: min
nl: Minimaliseren

# OutputQueueProcessingCanceled
source: Output message queue processing canceled
nl: Uitgaande berichtenstroom geannuleerd

# OutputQueueProcessingFinished
source: Output message queue processing finished
nl: Uitgaande berichtenstroom verwerkt

source: Simulation
nl: Simulatie
